
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НЕТО_СогласованнаяСкидкаПриИзменении()
	
	// +++ МАМ 25.05.2026
	ПриИзмененииСкидки();
	// --- МАМ 25.05.2026
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НЕТО_ПересчитатьТаблицу(Команда)
	
	// +++ МАМ 25.05.2026
	ПересчетСуммВТаблицах();
	// --- МАМ 25.05.2026
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	// +++ МАМ 25.05.2026
	РассчитатьСуммуСтроки(ТекущиеДанные, Элемент.Родитель.Имя);
	// --- МАМ 25.05.2026
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	// +++ МАМ 25.05.2026
	РассчитатьСуммуСтроки(ТекущиеДанные, Элемент.Родитель.Имя);
	// --- МАМ 25.05.2026
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	// +++ МАМ 25.05.2026
	РассчитатьСуммуСтроки(ТекущиеДанные, Элемент.Родитель.Имя);
	// --- МАМ 25.05.2026
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	// +++ МАМ 25.05.2026
	РассчитатьСуммуСтроки(ТекущиеДанные, Элемент.Родитель.Имя);
	// --- МАМ 25.05.2026
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	// +++ МАМ 25.05.2026
	РассчитатьСуммуСтроки(ТекущиеДанные, Элемент.Родитель.Имя);
	// --- МАМ 25.05.2026
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	// +++ МАМ 25.05.2026
	РассчитатьСуммуСтроки(ТекущиеДанные, Элемент.Родитель.Имя);
	// --- МАМ 25.05.2026
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриИзмененииСкидки()

	// +++ МАМ 25.05.2026
	Если Объект.Товары.Количество() = 0 И Объект.Услуги.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗадатьВопросПользователюАсинх();
	// --- МАМ 25.05.2026
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗадатьВопросПользователюАсинх()

	// +++ МАМ 25.05.2026
	ТекстВопроса = НСтр("ru = 'Изменен процент скидки. Пересчитать таблицы товаров и услуг?'");
	
	Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ПересчетСуммВТаблицах();
	// --- МАМ 25.05.2026
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчетСуммВТаблицах()
	
	// +++ МАМ 25.05.2026
	МассивТаблиц = Новый Массив;
	МассивТаблиц.Добавить(Объект.Товары);
	МассивТаблиц.Добавить(Объект.Услуги);
	
	Для Каждого Таблица Из МассивТаблиц Цикл
		
		Если Таблица.Количество() > 0 Тогда
			РасчитатьСумму(Таблица);
		КонецЕсли;
		
	КонецЦикла;
	// --- МАМ 25.05.2026
	
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьСумму(Таблица)

	// +++ МАМ 25.05.2026
	Для Каждого СтрокаТЧ Из Таблица Цикл
		РассчитатьСуммуСтроки(СтрокаТЧ, Таблица);
	КонецЦикла;
	// --- МАМ 25.05.2026
	
КонецПроцедуры


&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные, Таблица)
	
	// +++ МАМ 25.05.2026
	Если Объект.НЕТО_СогласованнаяСкидка = 0 Тогда
		КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
	ИначеЕсли Объект.НЕТО_СогласованнаяСкидка + ТекущиеДанные.Скидка > 100 Тогда
		КоэффициентСкидки = 0;
		
		ШаблонПоля = "Объект.%1[%2].Скидка";
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = СтрШаблон(ШаблонПоля, Таблица, ТекущиеДанные.ИсходныйНомерСтроки - 1);
		Сообщение.Текст = НСтр("ru = 'Суммарная скидка превышает 100%'");
		Сообщение.Сообщить();
	Иначе
		КоэффициентСкидки = 1 - (Объект.НЕТО_СогласованнаяСкидка + ТекущиеДанные.Скидка) / 100;
	КонецЕсли;
	// --- МАМ 25.05.2026
	
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	
	// +++ МАМ 25.05.2026
	РассчитатьСуммуДокумента();
	// --- МАМ 25.05.2026
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
