
#Область ПрограммныйИнтерфейс

Процедура ПриСозданииНаСервере(Форма) Экспорт
	
	Если Форма.ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		
		// Создание групп
		ГруппаГлавная = Форма.Элементы.Добавить("ГруппаГлавная", Тип("ГруппаФормы"), Форма);
		ГруппаГлавная.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаГлавная.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаГлавная.ОтображатьЗаголовок = Ложь;
		ГруппаГлавная.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ГруппаГлавная.РастягиватьПоГоризонтали = Ложь;
		ГруппаГлавная.Ширина = 90;
		
		ГруппаКолонкиШапки = Форма.Элементы.Добавить("ГруппаКолонкиШапки", Тип("ГруппаФормы"), ГруппаГлавная);
		ГруппаКолонкиШапки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаКолонкиШапки.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаКолонкиШапки.ОтображатьЗаголовок = Ложь;
		ГруппаКолонкиШапки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		ГруппаШапкаЛево = Форма.Элементы.Добавить("ГруппаШапкаЛево", Тип("ГруппаФормы"), ГруппаКолонкиШапки);
		ГруппаШапкаЛево.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаШапкаЛево.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаШапкаЛево.ОтображатьЗаголовок = Ложь;
		ГруппаШапкаЛево.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ГруппаШапкаЛево.РастягиватьПоГоризонтали = Ложь;
		
		ГруппаШапкаПраво = Форма.Элементы.Добавить("ГруппаШапкаПраво", Тип("ГруппаФормы"), ГруппаКолонкиШапки);
		ГруппаШапкаПраво.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаШапкаПраво.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаШапкаПраво.ОтображатьЗаголовок = Ложь;
		ГруппаШапкаПраво.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		
		ГруппаСуммаДокумента = Форма.Элементы.Добавить("ГруппаСуммаДокумента", Тип("ГруппаФормы"), ГруппаГлавная);
		ГруппаСуммаДокумента.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаСуммаДокумента.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаСуммаДокумента.ОтображатьЗаголовок = Ложь;
		ГруппаСуммаДокумента.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ГруппаСуммаДокумента.РастягиватьПоГоризонтали = Истина;
		
		ЯчейкаСуммаДокумента = Форма.Элементы.Добавить("ЯчейкаСуммаДокумента", Тип("ГруппаФормы"), ГруппаГлавная);
		ЯчейкаСуммаДокумента.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ЯчейкаСуммаДокумента.Отображение = ОтображениеОбычнойГруппы.Нет;
		ЯчейкаСуммаДокумента.ОтображатьЗаголовок = Ложь;
		ЯчейкаСуммаДокумента.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ЯчейкаСуммаДокумента.ЦветФона = ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет;
		ЯчейкаСуммаДокумента.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
		
		ГруппаПодвал = Форма.Элементы.Добавить("ГруппаПодвал", Тип("ГруппаФормы"), ГруппаГлавная);
		ГруппаПодвал.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаПодвал.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаПодвал.ОтображатьЗаголовок = Ложь;
		ГруппаПодвал.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ГруппаПодвал.РастягиватьПоГоризонтали = Истина;
		
		// Создание декорации надпись
		ДекорацияЗаполнениеСуммыДокумента = Форма.Элементы.Добавить("ДекорацияЗаполнениеСуммыДокумента",
											Тип("ДекорацияФормы"),
											ГруппаСуммаДокумента);
		ДекорацияЗаполнениеСуммыДокумента.Вид = ВидДекорацииФормы.Надпись;
		
		// Изменение свойств элементов
		Форма.Элементы.Ответственный.АвтоМаксимальнаяШирина = Ложь;
		Форма.Элементы.Комментарий.АвтоМаксимальнаяШирина = Ложь;
		
		// Перемещение элементов
		
		// -> ШапкаЛево
		Форма.Элементы.Переместить(Форма.Элементы.НомерДата, ГруппаШапкаЛево);
		Форма.Элементы.Переместить(Форма.Элементы.Организация, ГруппаШапкаЛево);
		
		// -> ШапкаПраво
		Форма.Элементы.Переместить(Форма.Элементы.Контрагент, ГруппаШапкаПраво);
		Форма.Элементы.Переместить(Форма.Элементы.Договор, ГруппаШапкаПраво);
		
		// -> ЯчейкаСуммаДокумента
		Форма.Элементы.Переместить(Форма.Элементы.СуммаДокумента, ЯчейкаСуммаДокумента);
		
		// -> СуммаДокумента
		Форма.Элементы.Переместить(ДекорацияЗаполнениеСуммыДокумента, ГруппаСуммаДокумента);
		
		// -> Подвал
		Форма.Элементы.Переместить(Форма.Элементы.Ответственный, ГруппаПодвал);
		Форма.Элементы.Переместить(Форма.Элементы.Комментарий, ГруппаПодвал);
		
		// -> В конец
		Форма.Элементы.Переместить(ЯчейкаСуммаДокумента, ГруппаГлавная);
		
		Если Форма.ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
			
			// Изменение свойств элементов
			Форма.Элементы.Основание.АвтоМаксимальнаяШирина = Ложь;
			
			// Создание группы
			ГруппаКолонкиПодвала = Форма.Элементы.Добавить("ГруппаКолонкиПодвала", Тип("ГруппаФормы"), ГруппаГлавная);
			ГруппаКолонкиПодвала.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаКолонкиПодвала.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаКолонкиПодвала.ОтображатьЗаголовок = Ложь;
			ГруппаКолонкиПодвала.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			ГруппаКолонкиПодвала.РастягиватьПоГоризонтали = Истина;
			
			// -> КолонкиПодвала
			Форма.Элементы.Переместить(Форма.Элементы.Основание, ГруппаКолонкиПодвала);
			Форма.Элементы.Переместить(ГруппаПодвал, ГруппаКолонкиПодвала);
			
			// -> В конец
			Форма.Элементы.Переместить(ЯчейкаСуммаДокумента, ГруппаГлавная);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" 
		ИЛИ Форма.ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		
		// Изменение свойств элементов
		Форма.Элементы.ГруппаШапкаЛево.РастягиватьПоГоризонтали = Ложь;
		
		// Создание элемента
		ЭлементКонтактноеЛицо = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
		ЭлементКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементКонтактноеЛицо.ПутьКДанным = "Объект.НЕТО_КонтактноеЛицо";
		
		// Настройка параметров связи
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент");
		МассивСвязей = Новый Массив();
		МассивСвязей.Добавить(НоваяСвязь);
		НовыеСвязи = Новый ФиксированныйМассив(МассивСвязей);
		ЭлементКонтактноеЛицо.СвязиПараметровВыбора = НовыеСвязи;
		
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		
		// Создание группы
		ГруппаСкидкаПересчет = Форма.Элементы.Добавить("ГруппаСкидкаПересчет", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево);
		ГруппаСкидкаПересчет.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаСкидкаПересчет.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаСкидкаПересчет.ОтображатьЗаголовок = Ложь;
		ГруппаСкидкаПересчет.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ГруппаСкидкаПересчет.СквозноеВыравнивание = СквозноеВыравнивание.НеИспользовать;
		
		// Создание элемента
		ЭлементСогласованнаяСкидка = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), ГруппаСкидкаПересчет);
		ЭлементСогласованнаяСкидка.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементСогласованнаяСкидка.ПутьКДанным = "Объект.НЕТО_СогласованнаяСкидка";
		ЭлементСогласованнаяСкидка.УстановитьДействие("ПриИзменении", "НЕТО_СогласованнаяСкидкаПриИзменении");
		
		// Изменение свойств элементов
		Форма.Элементы.Комментарий.АвтоМаксимальнаяШирина = Ложь;
		Форма.Элементы.Организация.РастягиватьПоГоризонтали = Истина;
		
		// Создание команды
		КомандаПересчитатьТаблицу = Форма.Команды.Добавить("КомандаПересчитатьТаблицу");
		КомандаПересчитатьТаблицу.Заголовок = "Пересчитать таблицу";
		КомандаПересчитатьТаблицу.Действие = "НЕТО_ПересчитатьТаблицу"; //указываем только имя процедуры
		
		// Создание кнопки
		КнопкаПересчитатьТаблицу = Форма.Элементы.Добавить("КнопкаПересчитатьТаблицу", Тип("КнопкаФормы"), ГруппаСкидкаПересчет);
		КнопкаПересчитатьТаблицу.Заголовок = "Пересчитать таблицу";
		КнопкаПересчитатьТаблицу.ИмяКоманды = "КомандаПересчитатьТаблицу";
		КнопкаПересчитатьТаблицу.Отображение = ОтображениеКнопки.КартинкаИТекст;
		КнопкаПересчитатьТаблицу.Картинка = БиблиотекаКартинок.Обновить;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти